apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_ieee802154_radio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <nuttx/debug.h>
#include <errno.h>
#include <stdio.h>
#include <sys/param.h>

#include <nuttx/wqueue.h>
#include <nuttx/mm/iob.h>

#include "nrf52_ieee802154_radio.h"
#include "nrf52_ieee802154_trace.h"

#include "nrf52_ieee802154_priv.h"

#include "hardware/nrf52_utils.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Constant from NRF52 manual */

#define NRF52_ED_RSSISCALE            (4)

/* ED configuration:
 *   - IRQ on EDEND event (sampling of energy detection complete)
 *   - shortcut between READY and EDSTART
 *   - shortcut between EDEND and DISABLE
 *
 * Set in nrf52_radioi8_energydetect() reset in nrf52_radioi8_isr_radio().
 *
 * EDSTART task set in nrf52_radioi8_energydetect().
 */

#define IEEE802154_ED_INT             (RADIO_INT_EDEND)
#define IEEE802154_ED_SHORTS          (RADIO_SHORTS_READY_EDSTART | \
                                       RADIO_SHORTS_EDEND_DISABLE)

/* RX configuration:
 *   - IRQ on END event (packet recveived)
 *   - shortcut between RXREADY and START
 *   - shortcut between END and DISABLE
 *
 * Set in nrf52_radioi8_rxenable() reset in nrf52_radioi8_rxenable().
 *
 * RXEN task set in nrf52_radioi8_rxenable() and
 * nrf52_radioi8_isr_radio() after RX handled and no pending ACKTX.
 */

#define IEEE802154_RX_INT              (RADIO_INT_END)
#define IEEE802154_RX_SHORTS           (RADIO_SHORTS_RXREADY_START |  \
                                        RADIO_SHORTS_END_DISABLE)

/* NOTE: for TX we trigger interrupts on PHYEND event, not END! */

/* TX CCA un-slotted configuration:
 *   - IRQ on PHYEND event
 *   - IRQ on CCABUSY event
 *   - shortcut between TXREADY and START
 *   - shortcut between PHYEND and DISABLE
 *   - shortcut between RXREADY and CCASTART
 *   - shortcut between CCAIDLE and STOP
 *   - shortcut between CCAIDLE and TXEN
 *
 * Set in nrf52_radioi8_radio_norm_setup() reset in
 * nrf52_radioi8_isr_radio().
 *
 * CCASTART task set in nrf52_radioi8_isr_tim() when CCA transfer.
 */

#define IEEE802154_TXCCAUNSLT_INT      (RADIO_INT_PHYEND |              \
                                        RADIO_INT_CCABUSY)
#define IEEE802154_TXCCAUNSLT_SHORTS   (RADIO_SHORTS_TXREADY_START |    \
                                        RADIO_SHORTS_PHYEND_DISABLE |   \
                                        RADIO_SHORTS_RXREADY_CCASTART | \
                                        RADIO_SHORTS_CCAIDLE_STOP |     \
                                        RADIO_SHORTS_CCAIDLE_TXEN)

/* TX CCA slotted configuration:
 *   - IRQ on PHYEND event
 *   - IRQ on CCABUSY event
 *   - IRQ on CCAIDLE event
 *   - shortcut between TXREADY and START
 *   - shortcut between PHYEND and DISABLE
 *
 * Set in nrf52_radioi8_radio_norm_setup() reset in
 * nrf52_radioi8_isr_radio().
 *
 * CCASTART task set in nrf52_radioi8_isr_tim() when CCA transfer.
 */

#define IEEE802154_TXCCASLT_INT        (RADIO_INT_PHYEND |              \
                                        RADIO_INT_CCAIDLE |             \
                                        RADIO_INT_CCABUSY)
#define IEEE802154_TXCCASLT_SHORTS     (RADIO_SHORTS_TXREADY_START |    \
                                        RADIO_SHORTS_PHYEND_DISABLE |   \
                                        RADIO_SHORTS_RXREADY_CCASTART)

/* TX no-CCA configuration:
 *   - IRQ on PHYEND event
 *   - shortcut between TXREADY and START
 *   - shortcut between PHYEND and DISABLE
 *
 * Set in nrf52_radioi8_radio_norm_setup() reset in
 * nrf52_radioi8_isr_radio().
 *
 * TXEN task set in nrf52_radioi8_radio_norm_trigger() when non-CCA
 * transfer or in nrf52_radioi8_isr_tim() for TXDELAY.
 */

#define IEEE802154_TX_INT              (RADIO_INT_PHYEND)
#define IEEE802154_TX_SHORTS           (RADIO_SHORTS_TXREADY_START |  \
                                        RADIO_SHORTS_PHYEND_DISABLE)

/* ACK configuration:
 *   - IRQ on PHYEND event
 *   - shortcut between PHYEND and DISABLE
 *
 * Set in nrf52_radioi8_ack_transmit reset in nrf52_radioi8_isr_radio().
 *
 * TXEN task set in nrf52_radioi8_ack_transmit().
 * START task set in nrf52_radioi8_isr_tim().
 */

#define IEEE802154_ACKTX_INT            (RADIO_INT_PHYEND)
#define IEEE802154_ACKTX_SHORTS         (RADIO_SHORTS_PHYEND_DISABLE)

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void nrf52_radioi8_rx_parse(struct nrf52_radioi8_dev_s *dev,
                                   uint8_t *ftype, uint8_t *cmdtype);
static void nrf52_radioi8_ack_transmit(struct nrf52_radioi8_dev_s *dev);
static bool nrf52_radioi8_filter(struct nrf52_radioi8_dev_s *dev);
#if NRF52_GTS_SLOTS > 0
static void nrf52_radioi8_gts_setup(struct nrf52_radioi8_dev_s *dev,
                                    uint8_t fifo, struct iob_s *frame);
#endif

/* Ops */

