apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
static void nrf52_radioi8_txstart(struct nrf52_radioi8_dev_s *dev);
static void nrf52_radioi8_ccastart(struct nrf52_radioi8_dev_s *dev);
static void nrf52_radioi8_notify_noack(struct nrf52_radioi8_dev_s *dev);
static int nrf52_radioi8_rxenable(struct nrf52_radioi8_dev_s *dev,
                                  bool enable);
static int nrf52_radioi8_energydetect(struct nrf52_radioi8_dev_s *dev,
                                      uint32_t nsymbols);
static int nrf52_radioi8_setchannel(struct nrf52_radioi8_dev_s *dev,
                                    uint8_t chan);
static int nrf52_radioi8_setcca(struct nrf52_radioi8_dev_s *dev,
                                struct ieee802154_cca_s *cca);
static void nrf52_radioi8_norm_setup_buf(struct nrf52_radioi8_dev_s *dev,
                                         uint8_t *buf, bool csma);
static void nrf52_radioi8_norm_setup(struct nrf52_radioi8_dev_s *dev,
                                     struct iob_s *frame, bool csma);
static void nrf52_radioi8_norm_trigger(struct nrf52_radioi8_dev_s *dev);
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
static void nrf52_radioi8_beacon_setup(struct nrf52_radioi8_dev_s *dev,
                                       uint8_t *data, uint8_t len);
static void nrf52_radioi8_beacon_tx(struct nrf52_radioi8_dev_s *dev);
#endif
static int nrf52_radioi8_reset(struct nrf52_radioi8_radio_s *dev);
static int nrf52_radioi8_csmapoll(struct nrf52_radioi8_dev_s *dev);
static int nrf52_radioi8_gtspoll(struct nrf52_radioi8_dev_s *dev);

/* Interrupts logic */

static void nrf52_radioi8_work_noack(void *arg);
static void nrf52_radioi8_work_rx(void *arg);
static void nrf52_radioi8_work_tx(void *arg);
static void nrf52_radioi8_work_busy(void *arg);
static void nrf52_radioi8_work_ed(void *arg);
static void nrf52_radioi8_state_rx(struct nrf52_radioi8_dev_s *dev);
static void nrf52_radioi8_state_tx(struct nrf52_radioi8_dev_s *dev);
static void nrf52_radioi8_state_acktx(struct nrf52_radioi8_dev_s *dev);
static void nrf52_radioi8_state_ed(struct nrf52_radioi8_dev_s *dev);
static int nrf52_radioi8_isr_radio(int irq, void *context, void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Packet buffers - must be byte aligned in RAM.
 *
 * NOTE: The first byte is PHR, the last byte is LQI.
 */

static uint8_t aligned_data(8)
  g_nrf52_radioi8_rxbuf[IEEE802154_MAX_PHY_PACKET_SIZE + 2];

static uint8_t aligned_data(8)
  g_nrf52_radioi8_txbuf[IEEE802154_MAX_PHY_PACKET_SIZE + 2];

static uint8_t aligned_data(8)
  g_nrf52_radioi8_ackbuf[IEEE802154_ACK_FRAME_SIZE + 1];

#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
static uint8_t aligned_data(8)
  g_nrf52_radioi8_beaconbuf[IEEE802154_MAX_PHY_PACKET_SIZE + 2];
#endif

/* Radio ops */

static struct nrf52_radioi8_radio_ops_s g_radioi8_radio_ops =
{
  .txstart      = nrf52_radioi8_txstart,
  .ccastart     = nrf52_radioi8_ccastart,
  .notify_noack = nrf52_radioi8_notify_noack,
  .rxenable     = nrf52_radioi8_rxenable,
  .energydetect = nrf52_radioi8_energydetect,
  .setchannel   = nrf52_radioi8_setchannel,
  .setcca       = nrf52_radioi8_setcca,
  .norm_setup   = nrf52_radioi8_norm_setup,
  .norm_trigger = nrf52_radioi8_norm_trigger,
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
  .beacon_setup = nrf52_radioi8_beacon_setup,
  .beacon_tx    = nrf52_radioi8_beacon_tx,
#endif
  .reset        = nrf52_radioi8_reset,
  .csma_poll    = nrf52_radioi8_csmapoll,
  .gts_poll     = nrf52_radioi8_gtspoll
};

/* Radio interface */

static struct nrf52_radioi8_radio_s g_radioi8_radio;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_radioi8_rx_parse
 *
 * Description:
 *   Get the RX frame type and command type if present.
 *
 ****************************************************************************/

static void nrf52_radioi8_rx_parse(struct nrf52_radioi8_dev_s *dev,
                                   uint8_t *ftype, uint8_t *cmdtype)
{
  uint16_t *frame_ctrl = NULL;
  uint8_t   smode      = 0;
  uint8_t   dmode      = 0;
  uint8_t   panid_comp = 0;
  int       i          = 0;

  /* Frame starts from offset 1 */

  i = 1;

  /* Frame ctrl */

  frame_ctrl = (uint16_t *)&dev->radio->rxbuf[i];
  i += sizeof(uint16_t);

  /* Frame seq */

  i += 1;

  /* Return now if a given frame is not a command frame */

  *ftype = ((*frame_ctrl & IEEE802154_FRAMECTRL_FTYPE) >>
            IEEE802154_FRAMECTRL_SHIFT_FTYPE);
  if (*ftype != IEEE802154_FRAME_COMMAND)
    {
      return;
    }

  /* Now we have to find the offset for the frame command type */

  smode = ((*frame_ctrl & IEEE802154_FRAMECTRL_SADDR) >>
           IEEE802154_FRAMECTRL_SHIFT_SADDR);

  dmode = ((*frame_ctrl & IEEE802154_FRAMECTRL_DADDR) >>
           IEEE802154_FRAMECTRL_SHIFT_DADDR);

  panid_comp = ((*frame_ctrl & IEEE802154_FRAMECTRL_PANIDCOMP) >>
                IEEE802154_FRAMECTRL_SHIFT_PANIDCOMP);

  if (dmode != IEEE802154_ADDRMODE_NONE)
    {
      i += IEEE802154_PANIDSIZE;

      if (dmode == IEEE802154_ADDRMODE_SHORT)
        {
          i += IEEE802154_SADDRSIZE;
        }
      else if (dmode == IEEE802154_ADDRMODE_EXTENDED)
        {
          i += IEEE802154_EADDRSIZE;
        }
    }

  if (smode != IEEE802154_ADDRMODE_NONE)
    {
      if (!panid_comp)
        {
          i += IEEE802154_PANIDSIZE;
        }

      if (smode == IEEE802154_ADDRMODE_SHORT)
        {
          i += IEEE802154_SADDRSIZE;
        }
      else if (smode == IEEE802154_ADDRMODE_EXTENDED)
        {
          i += IEEE802154_EADDRSIZE;
        }
    }

  *cmdtype = dev->radio->rxbuf[i];
}

/****************************************************************************
 * Name: nrf52_radioi8_ack_transmit
 *
 * Description:
 *   Transmit ACK.
 *
 ****************************************************************************/

static void nrf52_radioi8_ack_transmit(struct nrf52_radioi8_dev_s *dev)
{
  struct nrf52_radio_dev_s *lower   = NULL;
  uint8_t                  *ackbuf  = dev->radio->ackbuf;
  uint32_t                  regval  = 0;
  uint8_t                   ftype   = 0;
  uint8_t                   cmdtype = 0;
  bool                      pending = false;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

