apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
  /* Restore RX after ACK - we already are in DISABLE state so no need to
   * disable RX
   */

  if (dev->radio->state.rxenabled)
    {
      dev->radio->state.rxrestore = true;
    }

  /* Clear events */

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_READY_OFFSET, 0);
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_TXREADY_OFFSET, 0);
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_RXREADY_OFFSET, 0);

  /* Fill ACK buffer */

  ackbuf[0] = IEEE802154_ACK_FRAME_SIZE;
  ackbuf[1] = 0x02;
  ackbuf[2] = 0;
  ackbuf[3] = dev->radio->rxbuf[3];

  /* Get RX frame type */

  nrf52_radioi8_rx_parse(dev, &ftype, &cmdtype);

  /* If this is ACK for Data Request command - set frame pending flag */

  if (dev->state.devmode != NRF52_DEVMODE_ENDPOINT &&
      ftype == IEEE802154_FRAME_COMMAND &&
      cmdtype == IEEE802154_CMD_DATA_REQ)
    {
      pending = true;
    }

  /* Set frame pending flag for this ACK */

  if (pending)
    {
      ackbuf[1] |= 0x10;
    }

  /* Configure shorts and interrupts */

  NRF52_RADIO_SHRTSET(lower, IEEE802154_ACKTX_SHORTS);
  NRF52_RADIO_INTEN(lower, IEEE802154_ACKTX_INT);

  /* Set packet pointer - buffer must be aligned */

  regval = (uint32_t)ackbuf;
  DEBUGASSERT(nrf52_easydma_valid(regval));
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_PACKETPTR_OFFSET, regval);

  /* Set state to ACK */

  dev->radio->state.state = NRF52_RADIO_STATE_ACKTX;

  /* Enable TX - start TX is called from timer interrupt */

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_TXEN_OFFSET, 1);

  /* Run TIMER - TX is handled in timer isr */

  nrf52_radioi8_trace_put(RADIO_TRACE_ACKTX, pending);
  dev->tim->ops->setup(dev, NRF52_TIMER_CHAN_ACK, IEEE802154_ACKIFS_SYMBOLS);
}

/****************************************************************************
 * Name: nrf52_radioi8_filter
 *
 * Description:
 *   Filter received frames.
 *
 ****************************************************************************/

static bool nrf52_radioi8_filter(struct nrf52_radioi8_dev_s *dev)
{
  struct ieee802154_addr_s  addr;
  uint8_t                  *rx = &dev->radio->rxbuf[1];
  uint16_t                 *fc = (uint16_t *)&rx[0];

  /* Promiscuous mode */

  if (dev->state.rxmode == NRF52_RXMODE_PROMISC)
    {
      return true;
    }

  /* Beacon frame */

  if (((*fc & IEEE802154_FRAMECTRL_FTYPE) == IEEE802154_FRAME_BEACON) &&
      IEEE802154_PANIDCMP(IEEE802154_PANID_UNSPEC, &dev->state.addr.panid))
    {
      return true;
    }

  /* Get destination address */

  IEEE802154_PANIDCOPY(addr.panid, &rx[3]);
  addr.mode = ((*fc & IEEE802154_FRAMECTRL_DADDR) >>
               IEEE802154_FRAMECTRL_SHIFT_DADDR);
  if (addr.mode == IEEE802154_ADDRMODE_SHORT)
    {
      IEEE802154_SADDRCOPY(addr.saddr, &rx[5]);
    }
  else if (addr.mode == IEEE802154_ADDRMODE_EXTENDED)
    {
      IEEE802154_EADDRCOPY(addr.eaddr, &rx[5]);
    }

  /* PAN ID match */

  if (!IEEE802154_PANIDCMP(IEEE802154_PANID_UNSPEC, dev->state.addr.panid) &&
      !IEEE802154_PANIDCMP(addr.panid, &dev->state.addr.panid))
    {
      return false;
    }

  /* Destination address match */

  if (addr.mode == IEEE802154_ADDRMODE_SHORT)
    {
      if (IEEE802154_SADDRCMP(addr.saddr,
                              &dev->state.addr.saddr))
        {
          return true;
        }

      else if (IEEE802154_SADDRCMP(addr.saddr,
                                   IEEE802154_SADDR_UNSPEC))
        {
          return true;
        }
    }
  else if (addr.mode == IEEE802154_ADDRMODE_EXTENDED)
    {
      if (IEEE802154_EADDRCMP(addr.eaddr,
                              &dev->state.addr.eaddr))
        {
          return true;
        }

      else if (IEEE802154_EADDRCMP(addr.eaddr,
                                   IEEE802154_EADDR_UNSPEC))
        {
          return true;
        }
    }

  /* Otherwise drop this frame */

  return false;
}

#if NRF52_GTS_SLOTS > 0
/****************************************************************************
 * Name: nrf52_radioi8_gts_setup
 *
 * Description:
 *   Setup a GTS transaction.
 *
 ****************************************************************************/

static void nrf52_radioi8_gts_setup(struct nrf52_radioi8_dev_s *dev,
                                    uint8_t fifo, struct iob_s *frame)
{
  /* Missing logic */

  ASSERT(0);
}

/****************************************************************************
 * Name: nrf52_radioi8_dopoll_gts
 *
 * Description:
 *   This function is called in order to perform an out-of-sequence TX poll.
 *
 ****************************************************************************/

static void nrf52_radioi8_dopoll_gts(void *arg)
{
  struct nrf52_radioi8_dev_s *dev = (struct nrf52_radioi8_dev_s *)arg;
  int                         gts = 0;
  int                         len = 0;

  /* Get exclusive access to the driver */

  while (nxmutex_lock(&dev->lock) < 0)
    {
    }

  for (gts = 0; gts < NRF52_GTS_SLOTS; gts++)
    {
      if (!dev->state.gts_busy[gts])
        {
          len = dev->radiocb->poll(dev->radiocb, true,
                                   &dev->state.gts_desc[gts]);

          if (len > 0)
            {
              /* Now the txdesc is in use */

              dev->state.gts_busy[gts] = 1;

              /* Setup the GTS transaction */

              nrf52_radioi8_gts_setup(dev, gts,
                                      dev->state.gts_desc[gts]->frame);
            }
        }
    }

  nxmutex_unlock(&dev->lock);
}
#endif  /* NRF52_GTS_SLOTS > 0 */

/****************************************************************************
 * Name: nrf52_radioi8_txstart
 *
 * Description:
 *   Start transmission, TX must be armed (TXEN must be set).
 *
 ****************************************************************************/

static void nrf52_radioi8_txstart(struct nrf52_radioi8_dev_s *dev)
{
  struct nrf52_radio_dev_s *lower = NULL;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_START_OFFSET, 1);
}

/****************************************************************************
 * Name: nrf52_radioi8_ccastart
 *
 * Description:
 *   Start CCA, RX must be armed (RXEN must be set).
 *
 ****************************************************************************/

static void nrf52_radioi8_ccastart(struct nrf52_radioi8_dev_s *dev)
{
  struct nrf52_radio_dev_s *lower = NULL;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_CCASTART_OFFSET, 1);
}

/****************************************************************************
 * Name: nrf52_radioi8_notify_noack
 *
 * Description:
 *   Notify Radio layer about noack event.
 *
 ****************************************************************************/

