apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
static void nrf52_radioi8_notify_noack(struct nrf52_radioi8_dev_s *dev)
{
  /* If flag is set - no ACK was received */

  if (dev->radio->state.waitack == true)
    {
      /* Notify MAC layer */

      DEBUGASSERT(work_available(&dev->radio->noackwork));
      work_queue(HPWORK, &dev->radio->noackwork,
                 nrf52_radioi8_work_noack, (void *)dev, 0);

      /* Clear flag */

      dev->radio->state.waitack = false;
    }
}

/****************************************************************************
 * Name: nrf52_radioi8_rxenable
 *
 * Description:
 *  Enable/Disable receiver.
 *
 ****************************************************************************/

static int nrf52_radioi8_rxenable(struct nrf52_radioi8_dev_s *dev,
                                  bool enable)
{
  struct nrf52_radio_dev_s *lower  = NULL;
  uint32_t                  regval = 0;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  if (enable)
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_RXENABLE, 0);

      /* Clear events */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_END_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_READY_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_PHYEND_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_TXREADY_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_RXREADY_OFFSET, 0);

      /* Configure shorts and interrupts */

      NRF52_RADIO_SHRTSET(lower, IEEE802154_RX_SHORTS);
      NRF52_RADIO_INTEN(lower, IEEE802154_RX_INT);

      /* Set packet pointer - buffer must be aligned */

      regval = (uint32_t)dev->radio->rxbuf;
      DEBUGASSERT(nrf52_easydma_valid(regval));
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_PACKETPTR_OFFSET, regval);

      /* Set state to RX */

      dev->radio->state.state = NRF52_RADIO_STATE_RX;

      /* Start RX */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_RXEN_OFFSET, 1);
    }
  else
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_RXDISABLE, 0);

      /* Disable interrupts and shorts */

      NRF52_RADIO_INTCLR(lower, IEEE802154_RX_INT);
      NRF52_RADIO_SHRTSET(lower, 0);

      /* Disable RX */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_DISABLE_OFFSET, 1);
    }

  /* Store state */

  dev->radio->state.rxenabled = enable;

  /* Data returned by callback in ISR */

  return OK;
}

/****************************************************************************
 * Name: nrf52_radioi8_energydetect
 *
 * Description:
 *   Start the energy detect measurement.
 *
 ****************************************************************************/

static int nrf52_radioi8_energydetect(struct nrf52_radioi8_dev_s *dev,
                                      uint32_t nsymbols)
{
  struct nrf52_radio_dev_s *lower = NULL;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  /* Clear events */

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_EDEND_OFFSET, 0);
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_READY_OFFSET, 0);
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_RXREADY_OFFSET, 0);

  /* Configure shortucts and interrupts */

  NRF52_RADIO_SHRTSET(lower, IEEE802154_ED_SHORTS);
  NRF52_RADIO_INTEN(lower, IEEE802154_ED_INT);

  /* Configure ED symbols */

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EDCNT_OFFSET, nsymbols);

  /* Set state to ENERGY_DETECT (ED) */

  dev->radio->state.state = NRF52_RADIO_STATE_ED;

  /* Start RX */

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_RXEN_OFFSET, 1);

  /* Data returned by callback in ISR */

  return OK;
}

/****************************************************************************
 * Name: nrf52_radioi8_setchannel
 *
 * Description:
 *   Define the current radio channel the device is operating on.
 *
 ****************************************************************************/

static int nrf52_radioi8_setchannel(struct nrf52_radioi8_dev_s *dev,
                                   uint8_t chan)
{
  struct nrf52_radio_dev_s *lower = NULL;
  uint32_t                  freq  = 2405 + 5 * (chan - 11);

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  return NRF52_RADIO_FREQSET(lower, freq);
}

/****************************************************************************
 * Name: nrf52_radioi8_setcca
 *
 * Description:
 *   Configure the Clear Channel Assessement.
 *
 ****************************************************************************/

static int nrf52_radioi8_setcca(struct nrf52_radioi8_dev_s *dev,
                                      struct ieee802154_cca_s *cca)
{
  struct nrf52_radio_dev_s *lower = NULL;
  struct nrf52_radio_cca_s  c;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  /* Fill radio structure */

  memset(&c, 0, sizeof(struct nrf52_radio_cca_s));

  if (cca->use_ed && !cca->use_cs)
    {
      c.mode = NRF52_RADIO_CCA_ED;
    }
  else if (~cca->use_ed && cca->use_cs)
    {
      c.mode = NRF52_RADIO_CCA_CARRIER;
    }
  else if (cca->use_ed && cca->use_cs)
    {
      c.mode = NRF52_RADIO_CCA_CARRIER_AND_ED;
    }

  c.edthres   = cca->edth;
  c.corrthres = cca->csth;
  c.corrcnt   = 5;

  /* Configure radio */

  NRF52_RADIO_CCACFG(lower, &c);

  return OK;
}

/****************************************************************************
 * Name: nrf52_radioi8_norm_setup_buf
 *
 * Description:
 *   Setup a normal transaction (non GTS) from buffer.
 *
 ****************************************************************************/

static void nrf52_radioi8_norm_setup_buf(struct nrf52_radioi8_dev_s *dev,
                                         uint8_t *buf, bool csma)
{
  struct nrf52_radio_dev_s *lower  = NULL;
  uint32_t                  regval = 0;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  nrf52_radioi8_trace_put(RADIO_TRACE_CSMASETUP, csma);

  /* If RX is enabled - we have to temporarily disable it */

  if (dev->radio->state.rxenabled)
    {
      dev->macops.rxenable((struct ieee802154_radio_s *)dev, false);

      /* Restore RX after TX completed */

      dev->radio->state.rxrestore = true;
    }

