apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
  /* Set packet pointer - buffer must be aligned */

  regval = (uint32_t)buf;
  DEBUGASSERT(nrf52_easydma_valid(regval));
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_PACKETPTR_OFFSET, regval);

  if (csma)
    {
      /* Clear events */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_END_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_READY_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_PHYEND_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_TXREADY_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_CCABUSY_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_CCAIDLE_OFFSET, 0);

      /* Configure shorts and interrupts */

      if (dev->radio->state.slotted)
        {
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
          NRF52_RADIO_SHRTSET(lower, IEEE802154_TXCCASLT_SHORTS);
          NRF52_RADIO_INTEN(lower, IEEE802154_TXCCASLT_INT);
#else
          ASSERT(0);
#endif
        }
      else
        {
          NRF52_RADIO_SHRTSET(lower, IEEE802154_TXCCAUNSLT_SHORTS);
          NRF52_RADIO_INTEN(lower, IEEE802154_TXCCAUNSLT_INT);
        }

      dev->radio->state.state = NRF52_RADIO_STATE_TX_CSMA;
    }
  else
    {
      /* Clear events */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_END_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_READY_OFFSET, 0);
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_PHYEND_OFFSET, 0);

      /* Configure shorts and interrupts */

      NRF52_RADIO_SHRTSET(lower, IEEE802154_TX_SHORTS);
      NRF52_RADIO_INTEN(lower, IEEE802154_TX_INT);
      dev->radio->state.state = NRF52_RADIO_STATE_TX_NOCSMA;
    }
}

/****************************************************************************
 * Name: nrf52_radioi8_norm_setup
 *
 * Description:
 *   Setup a normal transaction (non GTS).
 *
 ****************************************************************************/

static void nrf52_radioi8_norm_setup(struct nrf52_radioi8_dev_s *dev,
                                     struct iob_s *frame, bool csma)
{
  /* The first byte in TX buffer is PHR */

  dev->radio->txbuf[0] = frame->io_len;

  /* Allocate space for CRC */

  dev->radio->txbuf[0] += 2;

  /* Copy frame to RX buffer - we must send from aligned buffer */

  memcpy(&dev->radio->txbuf[1], &frame->io_data[0], frame->io_len);

  /* Setup buffer */

  nrf52_radioi8_norm_setup_buf(dev, dev->radio->txbuf, csma);
}

/****************************************************************************
 * Name: nrf52_radioi8_trg_csma
 *
 * Description:
 *   Trigger transaction with CSMA-CA.
 *
 ****************************************************************************/

static void nrf52_radioi8_trg_csma(struct nrf52_radioi8_dev_s *dev)
{
  uint32_t delay = 0;

  /* Set state to TX */

  dev->radio->state.state = NRF52_RADIO_STATE_TX;

  /* Need slotted CSMA-CA */

  if (dev->radio->state.slotted)
    {
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
      if (!dev->radio->state.csma_busy)
        {
          /* Initial backoff state */

          dev->radio->state.NB = 0;
          dev->radio->state.CW = IEEE802154_CW0;
        }

      /* Battery life extension */

      if (dev->radio->state.ble)
        {
          dev->radio->state.BE = MIN(2, dev->radio->state.min_be);
        }
      else
        {
          dev->radio->state.BE = dev->radio->state.min_be;
        }

      /* Get random unit backoff period delay */

      delay = rand() % ((1 << dev->radio->state.BE) - 1);

      /* TODO:
       *  - locate backoff period boundary
       *  - perform CCA on backoff period boundary
       */

      ASSERT(0);
#else
      ASSERT(0);
#endif
    }

  /* Need un-slotted CSMA-CA */

  else
    {
      if (!dev->radio->state.csma_busy)
        {
          /* Initial backoff state */

          dev->radio->state.NB = 0;
          dev->radio->state.BE = dev->radio->state.min_be;
        }

      /* Get random unit backoff period delay */

      delay = rand() % ((1 << dev->radio->state.BE) - 1);
    }

  /* CSMA is in use */

  dev->radio->state.csma_busy = true;
  nrf52_radioi8_trace_put(RADIO_TRACE_CSMATRIGGER, delay);

  dev->tim->ops->setup(dev, NRF52_TIMER_CHAN_CSMADELAY,
                       delay * IEEE802154_UNIT_BACKOFF_PERIOD);
}

/****************************************************************************
 * Name: nrf52_radioi8_trg_nocsma
 *
 * Description:
 *   Trigger transaction without CSMA-CA;
 *
 ****************************************************************************/

static void nrf52_radioi8_trg_nocsma(struct nrf52_radioi8_dev_s *dev)
{
  struct nrf52_radio_dev_s *lower = NULL;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  /* Set state to TX */

  dev->radio->state.state = NRF52_RADIO_STATE_TX;

  /* Start TX - we transmit immediately */

  nrf52_radioi8_trace_put(RADIO_TRACE_NOCSMATRIGGER,
                          dev->radio->state.state);
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_TXEN_OFFSET, 1);
}

/****************************************************************************
 * Name: nrf52_radioi8_norm_trigger
 *
 * Description:
 *   Trigger normal transaction (non GTS).
 *
 ****************************************************************************/

static void nrf52_radioi8_norm_trigger(struct nrf52_radioi8_dev_s *dev)
{
  /* Wait for ACK */

  if (dev->radio->txbuf[1] & IEEE802154_FRAMECTRL_ACKREQ)
    {
      dev->radio->state.waitack = true;
    }

  /* CSMA transmission */

  if (dev->radio->state.state == NRF52_RADIO_STATE_TX_CSMA)
    {
      nrf52_radioi8_trg_csma(dev);
    }

  /* No-CSMA transmission */

  else if (dev->radio->state.state == NRF52_RADIO_STATE_TX_NOCSMA)
    {
      nrf52_radioi8_trg_nocsma(dev);
    }

  /* Invalid state */

  else
    {
      /* We should not be there */

      DEBUGASSERT(0);
    }
}

#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
/****************************************************************************
 * Name: nrf52_radioi8_beacon_setup
 *
 * Description:
 *   Setup a beacon frame transfer
 *
 ****************************************************************************/

static void nrf52_radioi8_beacon_setup(struct nrf52_radioi8_dev_s *dev,
                                       uint8_t *data, uint8_t len)
{
  /* Set beacon TX buffer */

  memcpy(&dev->radio->beaconbuf[1], data, len);

  /* Length = Frame data + CRC */

  dev->radio->beaconbuf[0] = len + 2;
}

/****************************************************************************
 * Name: nrf52_radioi8_beacon_tx
 *
 * Description:
 *   Transmit a beacon frame (non CSMA-CA transfer).
 *
 ****************************************************************************/

