apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
static void nrf52_radioi8_beacon_tx(struct nrf52_radioi8_dev_s *dev)
{
  /* Beacon buffer is ready to send - transmit as non CSMA-CA */

  nrf52_radioi8_norm_setup_buf(dev, dev->radio->beaconbuf, false);

  /* Send now */

  nrf52_radioi8_norm_trigger(dev);
}
#endif

/****************************************************************************
 * Name: nrf52_radioi8_reset
 *
 * Description:
 *   Reset radio state to work with IEEE 802.15.4.
 *
 ****************************************************************************/

static int nrf52_radioi8_reset(struct nrf52_radioi8_radio_s *dev)
{
  struct nrf52_radio_dev_s    *radio = NULL;
  struct nrf52_radio_crc_s     crc;
  struct nrf52_radio_pktcfg_s  pcfg;
  int                          ret   = OK;

  DEBUGASSERT(dev);
  radio = dev->lower;

  /* Reset radio state */

  memset(&dev->state, 0, sizeof(struct nrf52_radioi8_radio_data_s));

  /* Reset radio */

  NRF52_RADIO_RESET(radio);

  /* MAC parameters */

  dev->state.max_frame_waittime = IEEE802154_MAX_FRAME_WAITTIME;
  dev->state.max_csma_backoffs  = IEEE802154_MAX_CSMA_BACKOFFS;
  dev->state.min_be             = IEEE802154_MIN_BE;
  dev->state.max_be             = IEEE802154_MAX_BE;

  /* Set radio IEEE 802.15.4 mode */

  ret = NRF52_RADIO_MODESET(radio, NRF52_RADIO_MODE_IEEE802154);
  if (ret < 0)
    {
      goto errout;
    }

  /* Configure CRC */

  crc.len  = 2;
  crc.skip = NRF52_RADIO_CRC_SKIPADDR_IEEE802154;
  crc.poly = 0x011021;
  crc.init = 0;

  ret = NRF52_RADIO_CRCCFG(radio, &crc);
  if (ret < 0)
    {
      goto errout;
    }

  /* Configure packet for IEEE 802.15.4 mode */

  pcfg.max_len  = IEEE802154_MAX_PHY_PACKET_SIZE;
  pcfg.stat_len = 0;
  pcfg.bal_len  = 0;
  pcfg.lf_len   = 8;
  pcfg.s0_len   = 0;
  pcfg.s1_len   = 0;
  pcfg.ci_len   = 0;
  pcfg.pl_len   = NRF52_RADIO_PREAMBLE_32BITZERO;
  pcfg.term_len = 0;
  pcfg.crcinc   = true;
  pcfg.endian   = false;
  pcfg.whiteen  = false;

  ret = NRF52_RADIO_PKTCFG(radio, &pcfg);
  if (ret < 0)
    {
      goto errout;
    }

  /* Disable hardware TIFS */

  NRF52_RADIO_PUTREG(radio, NRF52_RADIO_MODECNF0_OFFSET,
                     RADIO_MODECNF0_RU);

  /* Set TX power */

  NRF52_RADIO_TXPWRSET(radio, 0);

  /* TODO: Configure LNA/PA */

errout:
  return ret;
}

/****************************************************************************
 * Name: nrf52_radioi8_dopoll_csma
 *
 * Description:
 *   Out-of-sequence TX poll.
 *
 ****************************************************************************/

void nrf52_radioi8_dopoll_csma(void *arg)
{
  struct nrf52_radioi8_dev_s *dev = (struct nrf52_radioi8_dev_s *)arg;
  int                         len = 0;

  /* Get exclusive access to the driver */

  while (nxmutex_lock(&dev->lock) < 0)
    {
    }

  /* If this a CSMA transaction and we have room in the CSMA */

  if (!dev->radio->state.csma_busy)
    {
      wlinfo("Polling for frame\n");
      len = dev->radiocb->poll(dev->radiocb, false, &dev->state.csma_desc);

      if (len > 0)
        {
          wlinfo("Frame received. Frame length: %d\n", len);

          /* Setup the CSMA transaction */

          dev->radio->ops->norm_setup(dev, dev->state.csma_desc->frame,
                                      true);
          dev->radio->ops->norm_trigger(dev);
        }
    }

  nxmutex_unlock(&dev->lock);
}

/****************************************************************************
 * Name: nrf52_radioi8_csmapoll
 *
 * Description:
 *   Handle CSMA poll.
 *
 ****************************************************************************/

static int nrf52_radioi8_csmapoll(struct nrf52_radioi8_dev_s *dev)
{
  /* Is our single work structure available?  It may not be if there are
   * pending interrupt actions and we will have to ignore the Tx
   * availability action.
   */

  if (work_available(&dev->radio->csma_pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(HPWORK, &dev->radio->csma_pollwork,
                 nrf52_radioi8_dopoll_csma, dev, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: nrf52_radioi8_gtspoll
 *
 * Description:
 *   Handle GTS poll.
 *
 ****************************************************************************/

static int nrf52_radioi8_gtspoll(struct nrf52_radioi8_dev_s *dev)
{
#if NRF52_GTS_SLOTS > 0
  /* Is our single work structure available?  It may not be if there are
   * pending interrupt actions and we will have to ignore the Tx
   * availability action.
   */

  if (work_available(&dev->radio->gts_pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(HPWORK, &dev->radio->gts_pollwork,
                 nrf52_radioi8_dopoll_gts, dev, 0);
    }

  return OK;
#else
  /* GTS not supported */

  return -ENOTSUP;
#endif
}

/****************************************************************************
 * Name: nrf52_radioi8_work_noack
 *
 * Description:
 *   Handle no ACK work.
 *
 ****************************************************************************/

static void nrf52_radioi8_work_noack(void *arg)
{
  struct nrf52_radioi8_dev_s *dev   = (struct nrf52_radioi8_dev_s *)arg;
  struct nrf52_radio_dev_s   *lower = NULL;
  struct ieee802154_txdesc_s *tx    = NULL;
  bool                       *busy  = NULL;
  bool                        csma  = false;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  nrf52_radioi8_trace_put(RADIO_TRACE_WORK_NOACK, 0);

  /* Get exclusive access to the driver */

  while (nxmutex_lock(&dev->lock) < 0)
    {
    }

  if (dev->state.txdelayed_busy)
    {
      tx   = dev->state.txdelayed_desc;
      busy = &dev->state.txdelayed_busy;
      csma = false;
    }
  else
    {
      tx   = dev->state.csma_desc;
      busy = &dev->radio->state.csma_busy;
      csma = true;
    }

  if (tx->retrycount > 0)
    {
      /* Disable RX */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_DISABLE_OFFSET, 1);

      /* Try again */

      tx->retrycount -= 1;
      nrf52_radioi8_trace_put(RADIO_TRACE_TXRETRY, tx->retrycount);
      nrf52_radioi8_norm_setup(dev, tx->frame, csma);
      nrf52_radioi8_norm_trigger(dev);
    }
  else
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_NOACK, 0);

