apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
      tx->conf->status = IEEE802154_STATUS_NO_ACK;
      tx->framepending = false;
      dev->radiocb->txdone(dev->radiocb, tx);
      *busy = false;
    }

  /* Unlock the radio device */

  nxmutex_unlock(&dev->lock);
}

/****************************************************************************
 * Name: nrf52_radioi8_work_irq
 *
 * Description:
 *   Handle RX work.
 *
 ****************************************************************************/

static void nrf52_radioi8_work_rx(void *arg)
{
  struct nrf52_radioi8_dev_s    *dev   = (struct nrf52_radioi8_dev_s *)arg;
  struct nrf52_radio_dev_s      *lower = NULL;
  struct ieee802154_primitive_s *prim  = NULL;
  struct ieee802154_data_ind_s  *ind   = NULL;
  uint8_t                        index = 0;
  bool                           crcok = false;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  nrf52_radioi8_trace_put(RADIO_TRACE_WORK_RX, 0);

  /* Get exclusive access to the driver */

  while (nxmutex_lock(&dev->lock) < 0)
    {
    }

  /* Check CRC */

  crcok = NRF52_RADIO_GETREG(lower, NRF52_RADIO_CRCSTATUS_OFFSET);
  if (dev->state.rxmode != NRF52_RXMODE_NOCRC && crcok == false)
    {
      goto out;
    }

  /* Allocate a data_ind to put the frame in */

  prim = ieee802154_primitive_allocate();
  ind = (struct ieee802154_data_ind_s *)prim;
  if (ind == NULL)
    {
      wlerr("ERROR: Unable to allocate data_ind. Discarding frame\n");
      goto out;
    }

  prim->type = IEEE802154_PRIMITIVE_IND_DATA;

  /* Allocate an IOB to put the frame into */

  ind->frame = iob_alloc(false);
  DEBUGASSERT(ind->frame != NULL);

  /* First byte is the PHR */

  ind->frame->io_len = dev->radio->rxbuf[0];

  /* Reduce len by 2, we only receive frames with correct crc, no check
   * required.
   */

  ind->frame->io_len -= 2;

  for (index = 0; index < ind->frame->io_len; index++)
    {
      ind->frame->io_data[index] = dev->radio->rxbuf[index + 1];
    }

  /* Set CRC fields to 0 */

  ind->frame->io_data[index + 1] = 0;
  ind->frame->io_data[index + 2] = 0;

  /* LQI is the last byte in RAM */

  ind->lqi = dev->radio->rxbuf[index + 1];

  /* RSSI is non-standard field and is not supported here.
   * TODO: get RSSI from LQI ?
   */

  ind->rssi = 0;

  /* Callback the receiver in the next highest layer */

  dev->radiocb->rxframe(dev->radiocb, ind);

out:

  /* Re-Enable RX if not handling ACK TX now */

  if (dev->radio->state.state != NRF52_RADIO_STATE_ACKTX)
    {
      /* Enable packet reception */

      dev->macops.rxenable((struct ieee802154_radio_s *)dev, true);
    }

  /* Unlock the radio device */

  nxmutex_unlock(&dev->lock);
}

/****************************************************************************
 * Name: nrf52_radioi8_work_tx
 *
 * Description:
 *   Handle TX work.
 *
 ****************************************************************************/

static void nrf52_radioi8_work_tx(void *arg)
{
  struct nrf52_radioi8_dev_s *dev = (struct nrf52_radioi8_dev_s *)arg;
  enum ieee802154_status_e    status;
  bool                        fpending = false;

  nrf52_radioi8_trace_put(RADIO_TRACE_WORK_TX, 0);

  /* Get exclusive access to the driver */

  while (nxmutex_lock(&dev->lock) < 0)
    {
    }

  /* Get frame pending flag from the last TX ACK */

  fpending = dev->radio->state.framepending;
  dev->radio->state.framepending = false;

  status = IEEE802154_STATUS_SUCCESS;

  if (dev->state.txdelayed_busy)
    {
      /* Inform the next layer of the transmission success/failure */

      dev->state.txdelayed_desc->conf->status = status;
      dev->state.txdelayed_desc->framepending = fpending;
      dev->radiocb->txdone(dev->radiocb, dev->state.txdelayed_desc);
      dev->state.txdelayed_desc = NULL;
      dev->state.txdelayed_busy = false;
    }
  else
    {
      /* Inform the next layer of the transmission success/failure */

      dev->state.csma_desc->conf->status = status;
      dev->state.csma_desc->framepending = fpending;
      dev->radiocb->txdone(dev->radiocb, dev->state.csma_desc);
      dev->state.csma_desc = NULL;

      /* We are now done with the transaction */

      dev->radio->state.csma_busy = false;

      /* Must unlock the radio before calling poll */

      nxmutex_unlock(&dev->lock);
      nrf52_radioi8_dopoll_csma(dev);
      while (nxmutex_lock(&dev->lock) < 0)
        {
        }
    }

  /* Re-Enable RX if not handling ACK TX now */

  if (dev->radio->state.state != NRF52_RADIO_STATE_ACKTX)
    {
      /* Enable packet reception */

      dev->macops.rxenable((struct ieee802154_radio_s *)dev, true);
    }

  /* Unlock the radio device */

  nxmutex_unlock(&dev->lock);
}

/****************************************************************************
 * Name: nrf52_radioi8_work_busy
 *
 * Description:
 *   Handle CCABUSY work.
 *
 ****************************************************************************/

static void nrf52_radioi8_work_busy(void *arg)
{
  struct nrf52_radioi8_dev_s *dev = (struct nrf52_radioi8_dev_s *)arg;

  nrf52_radioi8_trace_put(RADIO_TRACE_WORK_BUSY, 0);

  /* Get exclusive access to the driver */

  while (nxmutex_lock(&dev->lock) < 0)
    {
    }

  dev->state.txdelayed_desc->conf->status =
    IEEE802154_STATUS_CHANNEL_ACCESS_FAILURE;

  dev->radiocb->txdone(dev->radiocb, dev->state.txdelayed_desc);

  /* Unlock the radio device */

  nxmutex_unlock(&dev->lock);
}

/****************************************************************************
 * Name: nrf52_radioi8_work_ed
 *
 * Description:
 *   Handle ED work.
 *
 ****************************************************************************/

static void nrf52_radioi8_work_ed(void *arg)
{
  struct nrf52_radioi8_dev_s *dev   = (struct nrf52_radioi8_dev_s *)arg;
  struct nrf52_radio_dev_s   *lower = NULL;
  int                         ed    = 0;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  nrf52_radioi8_trace_put(RADIO_TRACE_WORK_ED, 0);

  /* Get result */

  ed = NRF52_RADIO_GETREG(lower, NRF52_RADIO_EDSAMPLE_OFFSET);

  /* Convert to IEEE 802.15.4 scale */

  ed = ((ed > 63) ? 255: (ed * NRF52_ED_RSSISCALE));

