apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
  /* Callback the receiver in the next highest layer */

  dev->radiocb->edresult(dev->radiocb, ed);
}

/****************************************************************************
 * Name: nrf52_radioi8_state_rx
 *
 * Description:
 *   Handle radio interrupt for RX state.
 *
 ****************************************************************************/

static void nrf52_radioi8_state_rx(struct nrf52_radioi8_dev_s *dev)
{
  uint8_t *rxbuf = dev->radio->rxbuf;

  /* Frame filter */

  if (dev->radio->state.waitack == false)
    {
      if (!nrf52_radioi8_filter(dev))
        {
          nrf52_radioi8_trace_put(RADIO_TRACE_DROPFRAME, 0);

          /* Enable RX and ignore this frame */

          dev->macops.rxenable((struct ieee802154_radio_s *)dev,
                              true);
          return;
        }
    }

#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
  /* TODO: resync with beacon ? */

  if (dev->radio->state.wait_for_beacon == true)
    {
      uint16_t *fc = (uint16_t *)&rxbuf[0];

      /* TODO: NOT TESTES, should we check panid here ? */

      if (((*fc & IEEE802154_FRAMECTRL_FTYPE) == IEEE802154_FRAME_BEACON) &&
          IEEE802154_PANIDCMP(IEEE802154_PANID_UNSPEC,
                              &dev->state.addr.panid))
        {
          /* Start RTC */

          dev->rtc->ops->start(dev);

          dev->radio->state.wait_for_beacon = false;
        }
    }
#endif

  /* Start ACK handling now - this must be done in isr */

  if (dev->state.rxmode == NRF52_RXMODE_NORMAL &&
      rxbuf[1] & IEEE802154_FRAMECTRL_ACKREQ &&
      rxbuf[0] != IEEE802154_ACK_FRAME_SIZE)
    {
      nrf52_radioi8_ack_transmit(dev);
    }

  /* Store RX frame long flag */

  dev->radio->state.rxlong = rxbuf[0] > 18 ? true : false;

  /* We don't wait for TX ACK - forward this frame to MAC */

  if (dev->radio->state.waitack == false)
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_RXDONE, 0);

      /* Receive DONE */

      if (work_available(&dev->radio->irqwork))
        {
          work_queue(HPWORK, &dev->radio->irqwork,
                     nrf52_radioi8_work_rx, (void *)dev, 0);
        }
    }

  /* We wait for TX ACK and this frame is ACK - confirm TX to MAC */

  else if (rxbuf[0] == IEEE802154_ACK_FRAME_SIZE &&
           dev->radio->state.waitack == true)
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_RXACKDONE, 0);

      /* ACK frame received */

      dev->radio->state.waitack = false;

      /* Get frame pending flag */

      dev->radio->state.framepending = rxbuf[1] & 0x10;

      /* Clear timer */

      dev->tim->ops->stop(dev);

      /* This is ACK - notify MAC that TX complete */

      if (work_available(&dev->radio->irqwork))
        {
          work_queue(HPWORK, &dev->radio->irqwork,
                     nrf52_radioi8_work_tx, (void *)dev, 0);
        }
    }

  /* We wait for TX ACK and this is not ACK - notify TX failure */

  else
    {
      /* Clear flag */

      dev->radio->state.waitack = false;

      /* And notify MAC */

      DEBUGASSERT(work_available(&dev->radio->noackwork));
      work_queue(HPWORK, &dev->radio->noackwork,
                 nrf52_radioi8_work_noack, (void *)dev, 0);
    }
}

/****************************************************************************
 * Name: nrf52_radioi8_state_tx
 *
 * Description:
 *   Handle radio interrupt for TX state.
 *
 ****************************************************************************/

static void nrf52_radioi8_state_tx(struct nrf52_radioi8_dev_s *dev)
{
  struct nrf52_radio_dev_s *lower   = NULL;

  DEBUGASSERT(dev);
  lower = dev->radio->lower;

  if (dev->radio->state.waitack == true)
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_WAITACK, 0);

      /* Start timer and wait for ACK */

      dev->tim->ops->setup(dev, NRF52_TIMER_CHAN_WAITACK,
                           IEEE802154_ACK_WAIT);
    }
  else
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_TXDONE, 0);

      /* Transmit DONE */

      if (work_available(&dev->radio->irqwork))
        {
          work_queue(HPWORK, &dev->radio->irqwork,
                     nrf52_radioi8_work_tx, (void *)dev, 0);
        }
    }

  /* CCABUSY event for TX */

  if (NRF52_RADIO_GETREG(lower, NRF52_RADIO_EVENTS_CCABUSY_OFFSET))
    {
      nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_TXCCABUSY, 0);

      /* Clear event */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_CCABUSY_OFFSET, 0);

      /* Slotted CSMA-CA */

      if (dev->radio->state.slotted == true)
        {
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
          dev->radio->state.NB += 1;
          dev->radio->state.CW = IEEE802154_CW0;
          dev->radio->state.BE = MIN(2, dev->radio->state.min_be);

          if (dev->radio->state.NB > dev->radio->state.max_csma_backoffs)
            {
              /* Return failure to MAC */

              if (work_available(&dev->radio->irqwork))
                {
                  work_queue(HPWORK, &dev->radio->irqwork,
                             nrf52_radioi8_work_busy, (void *)dev, 0);
                }
            }
          else
            {
              /* Try again */

              dev->radio->state.state = NRF52_RADIO_STATE_TX_CSMA;
              nrf52_radioi8_norm_trigger(dev);

              /* Do not restore RX */

              return;
            }
#else
          ASSERT(0);
#endif
        }

      /* Un-slotted CSMA-CA */

      else
        {
          /* Update backoff */

          dev->radio->state.NB -= 1;
          dev->radio->state.BE = MIN(dev->radio->state.BE + 1,
                                     dev->radio->state.max_be);

          if (dev->radio->state.NB > dev->radio->state.max_csma_backoffs)
            {
              /* Return failure to MAC */

              if (work_available(&dev->radio->irqwork))
                {
                  work_queue(HPWORK, &dev->radio->irqwork,
                             nrf52_radioi8_work_busy, (void *)dev, 0);
                }
            }
          else
            {
              /* Try again */

              dev->radio->state.state = NRF52_RADIO_STATE_TX_CSMA;
              nrf52_radioi8_norm_trigger(dev);

