apache/nuttx/arch/arm/src/nrf52/nrf52_ieee802154_radio.c
              /* Do not restore RX */

              return;
            }
        }
    }

  /* CCAIDLE event for TX */

  if (NRF52_RADIO_GETREG(lower, NRF52_RADIO_EVENTS_CCAIDLE_OFFSET))
    {
      /* Clear event */

      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_CCAIDLE_OFFSET, 0);

      /* Slotted CSMA-CA */

      if (dev->radio->state.slotted == true)
        {
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
          dev->radio->state.CW -= 1;

          if (dev->radio->state.CW == 0)
            {
              /* Enable TX - short TXREADY-START is enabled */

              NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_TXEN_OFFSET, 1);
            }
          else
            {
              /* Do not restore RX */

              return;
            }
#else
          ASSERT(0);
#endif
        }

      /* Un-slotted CSMA-CA */

      else
        {
          /* Nothing here */
        }
    }

  /* Restore RX */

  if (dev->radio->state.rxrestore | dev->radio->state.waitack)
    {
      dev->macops.rxenable((struct ieee802154_radio_s *)dev, true);
      dev->radio->state.rxrestore = false;
    }
}

/****************************************************************************
 * Name: nrf52_radioi8_state_acktx
 *
 * Description:
 *   Handle radio interrupt for ACKTX state.
 *
 ****************************************************************************/

static void nrf52_radioi8_state_acktx(struct nrf52_radioi8_dev_s *dev)
{
  nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_ACKTX, 0);

  /* Handle pending TX */

  if (dev->state.txdelayed_busy)
    {
      nrf52_radioi8_norm_setup(dev,
                               dev->state.txdelayed_desc->frame,
                               false);

      /* Send with timer to keep IFS */

      if (dev->radio->state.rxlong)
        {
          dev->tim->ops->setup(dev, NRF52_TIMER_CHAN_TXDELAY,
                               IEEE802154_LIFS_SYMBOLS);
        }
      else
        {
          dev->tim->ops->setup(dev, NRF52_TIMER_CHAN_TXDELAY,
                               IEEE802154_SIFS_SYMBOLS);
        }
    }

  /* Restore RX */

  else if (dev->radio->state.rxrestore)
    {
      dev->macops.rxenable((struct ieee802154_radio_s *)dev, true);
      dev->radio->state.rxrestore = false;
    }
}

/****************************************************************************
 * Name: nrf52_radioi8_state_ed
 *
 * Description:
 *   Handle radio interrupt for ED state.
 *
 ****************************************************************************/

static void nrf52_radioi8_state_ed(struct nrf52_radioi8_dev_s *dev)
{
  /* Energy detect DONE */

  DEBUGASSERT(work_available(&dev->radio->irqwork));
  work_queue(HPWORK, &dev->radio->irqwork,
             nrf52_radioi8_work_ed, (void *)dev, 0);
}

/****************************************************************************
 * Name: nrf52_radioi8_isr_radio
 *
 * Description:
 *   Radio IEEE 802.15.4 interrupt handler.
 *
 ****************************************************************************/

static int nrf52_radioi8_isr_radio(int irq, void *context, void *arg)
{
  struct nrf52_radioi8_dev_s *dev   = (struct nrf52_radioi8_dev_s *)arg;
  struct nrf52_radio_dev_s   *lower = NULL;
  irqstate_t                  flags;
  uint8_t                     state;

  DEBUGASSERT(dev != NULL);
  lower = dev->radio->lower;

  flags = enter_critical_section();

  nrf52_radioi8_trace_put(RADIO_TRACE_IRQ_RADIO, 0);

  /* Get state */

  state = dev->radio->state.state;
  dev->radio->state.state = NRF52_RADIO_STATE_DISABLED;

  /* Always clear END and PHYEND events */

  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_END_OFFSET, 0);
  NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_PHYEND_OFFSET, 0);

  /* Clear interrupts and shorts */

  NRF52_RADIO_INTCLR(lower, 0xffffffff);
  NRF52_RADIO_SHRTSET(lower, 0);

  /* If by chance radio is not disabled - disable it now. This should be
   * handled by SHORTS, but this not always work...
   */

  if (NRF52_RADIO_GETREG(lower, NRF52_RADIO_STATE_OFFSET)
      != RADIO_STATE_DISABLED)
    {
      NRF52_RADIO_PUTREG(lower, NRF52_RADIO_TASKS_DISABLE_OFFSET, 1);

      /* Don't wait for the DISABLED event, hopefully the radio will be
       * disabled by the time we use it again. Max delay is TX->DISABLED
       * and takes 21us.
       */
    }

  /* Handle IRQ depending on the current state */

  switch (state)
    {
      case NRF52_RADIO_STATE_RX:
        {
          nrf52_radioi8_state_rx(dev);

          break;
        }

      case NRF52_RADIO_STATE_TX:
        {
          nrf52_radioi8_state_tx(dev);

          break;
        }

      case NRF52_RADIO_STATE_ACKTX:
        {
          nrf52_radioi8_state_acktx(dev);

          break;
        }

      case NRF52_RADIO_STATE_ED:
        {
          /* Clear event */

          NRF52_RADIO_PUTREG(lower, NRF52_RADIO_EVENTS_EDEND_OFFSET, 0);

          nrf52_radioi8_state_ed(dev);

          break;
        }

      default:
        {
          ASSERT(0);
          break;
        }
    }

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_radioi8_radio_init
 *
 * Description:
 *   Initialize RADIO for IEEE802154 operations.
 *
 ****************************************************************************/

struct nrf52_radioi8_radio_s *
nrf52_radioi8_radio_init(struct nrf52_radioi8_dev_s *dev,
                         struct nrf52_radio_board_s *board)
{
  struct nrf52_radio_dev_s *radio = NULL;

  /* Initialize lower-half radio */

  radio = nrf52_radio_initialize(0, board);
  if (radio == NULL)
    {
      wlerr("nrf52_radio_initialize failed %d\n", -errno);
      return NULL;
    }

  /* Attach custom RADIO interrupt */

  irq_attach(radio->irq, nrf52_radioi8_isr_radio, dev);
  up_enable_irq(radio->irq);

  /* Set interrupts priority */

  up_prioritize_irq(radio->irq, 0);

  /* Connect radioer */

  memset(&g_radioi8_radio, 0, sizeof(struct nrf52_radioi8_radio_s));
  g_radioi8_radio.ops   = &g_radioi8_radio_ops;
  g_radioi8_radio.lower = radio;

  /* Connect buffers */

  g_radioi8_radio.rxbuf     = g_nrf52_radioi8_rxbuf;
  g_radioi8_radio.txbuf     = g_nrf52_radioi8_txbuf;
  g_radioi8_radio.ackbuf    = g_nrf52_radioi8_ackbuf;
#ifdef CONFIG_NRF52_RADIO_IEEE802154_SUPERFRAME
  g_radioi8_radio.beaconbuf = g_nrf52_radioi8_beaconbuf;
#endif

  return &g_radioi8_radio;
}
